docs/inclass06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 21:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 6</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 6</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org51b7ffc">1. Instructions</a></li>
<li><a href="#org3c8e0e7">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org51b7ffc" class="outline-2">
<h2 id="org51b7ffc"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a recap exercise.
</p>

<div class="org-src-container">
<pre class="src src-java">
<span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">BoundedQueue</span> {
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Object</span> <span style="color: #dcaeea;">rep</span>[];
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">front</span> = 0;
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">back</span> = -1;
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">size</span> = 0;
    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">count</span> = 0;

    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">BoundedQueue</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">size</span>) {
        <span style="color: #51afef;">if</span> (size &gt; 0) {
            <span style="color: #51afef;">this</span>.size = size;
            rep = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Object</span>[size];
            back = size - 1;
        }  }

    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">isEmpty</span>() { <span style="color: #51afef;">return</span> (count == 0); }
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">isFull</span>() { <span style="color: #51afef;">return</span> (count == size); }
    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">getCount</span>() { <span style="color: #51afef;">return</span> count; }

    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">put</span>(<span style="color: #ECBE7B;">Object</span> <span style="color: #dcaeea;">e</span>) {
        <span style="color: #51afef;">if</span> (e != <span style="color: #a9a1e1;">null</span> &amp;&amp; <span style="color: #51afef; font-weight: bold;">!</span>isFull()) {
            back++;
            <span style="color: #51afef;">if</span> (back &gt;= size)
                back = 0;
            rep[back] = e;
            count++;
        } }

    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Object</span> <span style="color: #c678dd;">get</span>() {
        <span style="color: #ECBE7B;">Object</span> <span style="color: #dcaeea;">result</span> = <span style="color: #a9a1e1;">null</span>;
        <span style="color: #51afef;">if</span> (<span style="color: #51afef; font-weight: bold;">!</span>isEmpty()) {
            result = rep[front];
            rep[front] = <span style="color: #a9a1e1;">null</span>;
            front++;
            <span style="color: #51afef;">if</span> (front &gt;= size)
                front = 0;
            count--;
        }
        <span style="color: #51afef;">return</span> result;
    }
    <span style="color: #a9a1e1;">@Override</span> <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #c678dd;">toString</span>() {
        <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">result</span> = <span style="color: #98be65;">"front = "</span> + front;
        result += <span style="color: #98be65;">"; back = "</span> + back;
        result += <span style="color: #98be65;">"; size = "</span> + size;
        result += <span style="color: #98be65;">"; count = "</span> + count;
        result += <span style="color: #98be65;">"; rep = ["</span>;
        <span style="color: #51afef;">for</span> (<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0; i &lt; rep.<span style="color: #ECBE7B;">length</span>; i++) {
            <span style="color: #51afef;">if</span> (i &lt; rep.<span style="color: #ECBE7B;">length</span>-1)
                result = result + rep[i] + <span style="color: #98be65;">", "</span>;
            <span style="color: #51afef;">else</span>
                result = result + rep[i];
        }
        <span style="color: #51afef;">return</span> result + <span style="color: #98be65;">"]"</span>;
    }
}

</pre>
</div>


<ol class="org-ol">
<li>How would Liskov describe a typical bounded queue?</li>
<li>What is wrong with <code>toString()</code>? What needs to be done to fix it? Make it so.</li>
<li>Write some sample client code to exercise the data structure. Include some non-happy-path cases. Would Bloch likely change the behavior? If so, how?</li>
<li>Write contracts for each method (as written), including the constructor.</li>
<li>Build a rep-invariant. Focus on the code in <code>get()</code>. There are also lots of constraints on the array indices; these are quite tricky to get right. The constructor also introduces some complexity.</li>
<li><p>
Suppose we removed the line
</p>
<div class="org-src-container">
<pre class="src src-java">rep[front] = <span style="color: #a9a1e1;">null</span>;       
</pre>
</div>
<p>
from <code>get()</code>.
</p>
<ol class="org-ol">
<li>Informally, why is this wrong?</li>
<li>Formally, where does the correctness proof break down?</li>
<li>Could a client ever see the problem?</li>
</ol></li>
<li>Now that we've done some AF/RI analysis, what changes make the implementation better? btw - this is code straight out of a textbook.</li>
<li>Could this data structure be made immutable? If so, what would change in the contracts and method headers? What would likely change in the implementation?</li>
</ol>
</div>
</div>



<div id="outline-container-org3c8e0e7" class="outline-2">
<h2 id="org3c8e0e7"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
